#ifndef __SIFMODULE_H_
#define __SIFMODULE_H_

/**********************************************************************************************
 *                             Include File
**********************************************************************************************/
#include <stdint.h>
/**********************************************************************************************
*							   Macro Define
**********************************************************************************************/
#define SIF_RX_PORT         GPIOB
#define SIF_RX_PIN          GPIO_PIN_11
#define SIF_TX_PORT         GPIOB
#define SIF_TX_PIN          GPIO_PIN_10
#define SIF_INPUT_EXTI_LINE EXTI_LINE11
#define SIF_INPUT_IRQn      EXTI15_10_IRQn

/**********************************************************************************************
*							   		Type Define
**********************************************************************************************/
typedef enum
{
    SYNC_SIGNAL=0,             //接收同步低电平信号状态
    SEND_DATA=1,             //接收同步高电平信号状态
    SEND_DATA_COMPLETE=2,           //读取数据码电平状态
    SEND_END=3,
}TRS_STATE_e;            

typedef enum
{
	INITIAL_STATE = 0,            //初始状态，等待接收同步信号
	SYNC_L_STATE = 1,             //接收同步低电平信号状态
	SYNC_H_STATE = 2,             //接收同步高电平信号状态
	DATA_REV_STATE = 3,           //读取数据码电平状态
	END_SIGNAL_STATE = 4,         //接收结束电平信号状态
	RESTART_REV_STATE = 5         //接收过程出错重新接收状态
}REV_STATE_e;                   //接收数据状态枚举

typedef struct
{
    uint8_t byState;
    uint8_t bySoc;
    uint8_t byVol;
    uint8_t byCur;
    uint8_t byTemp;
    uint8_t byCheck;
}stSifSendData;

extern stSifSendData g_stSifData;
///**********************************************************************************************
//*							   Variable Declaration
//**********************************************************************************************/

///**********************************************************************************************
//*                              Function Declaration
//**********************************************************************************************/


void Sif_Init(void);
void SendSifData(void);
uint8_t GetSifData(uint8_t* pSifData);
/**********************************************************************************************
 * EOF
**********************************************************************************************/
#endif
